# 1.Найти сумму чисел списка стоящих на нечетной позиции
# Пример:[1,2,3,4] -> 4
num = [2, 3, 5, 6, 9, 5, 10]
sum = 0
for i in range (len(num)):
    if (i % 2 == 0):
        sum += num[i]
print (sum)

# 2.Найти произведение пар чисел в списке. Парой считаем первый и последний элемент, второй и предпоследний и т.д. 
# Пример: [2, 3, 4, 5, 6] => [12, 15, 16]; [2, 3, 5, 6] => [12, 15]



# 3.В заданном списке вещественных чисел найдите разницу между максимальным и минимальным значением дробной части элементов. 
# Пример: [1.1, 1.2, 3.1, 5, 10.01] => 0.19



# 4.Написать программу преобразования десятичного числа в двоичное